tap "go-task/tap"
tap "supabase/tap"
# Debugger for the Go programming language
brew "delve"
# Command-line tool for DigitalOcean
brew "doctl"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# GNU utilities for networking
brew "inetutils"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Linux virtual machines
brew "lima"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Object-relational database system
brew "postgresql@14"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Desktop password and login vault
cask "bitwarden"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for the Zulip team chat platform
cask "zulip"
vscode "caponetto.vscode-diff-viewer"
vscode "craigmaslowski.erb"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "tal7aouy.theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@anthropic-ai/claude-code"
npm "typescript-language-server"
npm "typescript"
