tap "go-task/tap"
tap "supabase/tap"
# Debugger for the Go programming language
brew "delve"
# Command-line tool for DigitalOcean
brew "doctl"
# Identify or delete duplicate files
brew "fdupes"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Linux virtual machines
brew "lima"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Supabase CLI
brew "supabase/tap/supabase"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "docker"
cask "iterm2"
cask "postman"
# Open-source code editor
cask "visual-studio-code"
vscode "caponetto.vscode-diff-viewer"
vscode "craigmaslowski.erb"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "tal7aouy.theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
