tap "go-task/tap"
tap "supabase/tap"
# Debugger for the Go programming language
brew "delve"
# Command-line tool for DigitalOcean
brew "doctl"
# Identify or delete duplicate files
brew "fdupes"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Linux virtual machines
brew "lima"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Supabase CLI
brew "supabase/tap/supabase"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source code editor
cask "visual-studio-code"
vscode "caponetto.vscode-diff-viewer"
vscode "craigmaslowski.erb"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "tal7aouy.theme"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
